####1 задание

###q = int(input('Введите день: '))
###if q == 1:
###    print('Понедельник')
###elif q == 2:
###    print('Вторник')
###elif q == 3:
###    print('Среда')
###elif q == 4:
###    print('Четверг')
###elif q == 5:
###    print('Пятница')
###elif q == 6:
###    print('Суббота')
###elif q == 7:
###    print('Воскресенье')
###else:
###    print('нет такого')
##    ###2 задание
##ax = float(input('Введите координаты точки a по оси x:'))
##ay = float(input('Введите координаты точки a по оси y:'))
##bx = float(input('Введите координаты точки b по оси x:'))
##by = float(input('Введите координаты точки b по оси y:'))

##import math
##distans = math.sqrt((ax-bx)**2+(ay-by)**2)
##print(f'Растояние между точкой A до точки B = {distans}' )

######задание 3

#a = int(input('Введите номер четверти в которой бы хотели узнать диапозон возможных координат: '))

#if a == 1:
#    print('В первой четверти - x > 0 y > 0')
#elif a == 2:
#    print('Во второй четверти - x < 0 y > 0')
#elif a == 3:
#    print('В третьей четверти - x < 0 y < 0')
#elif a == 4:
#    print('В четвертой четверти - x > 0 y < 0')
#else:
#    print('Такой четверти нет :(')

######задание 4

a = int(input('Введите число: '))
tmp = 1;
while tmp<=a:

   if tmp%2==0:
       print(tmp)
       tmp+=1
   else:
    tmp+=1
        


